"""
Задача №1. За день машина проезжает n километров. Сколько дней нужно, чтобы проехать маршрут длиной m
километров? При решении этой задачи нельзя пользоваться условной инструкцией if и циклами.
Input:
n = 700
m = 750
Output:
2
"""
# import math
# per_day = int(input("Введите дистанцию за день: "))
# dist = int(input("Введите общую дистанцию: "))

# if dist <= 0:
#     print("Не корректный ввод")
# # print(f"Потребуется дней: {(dist + per_day - 1) // per_day }") 
# print(f"Потребуется дней: {math.ceil(dist / per_day)}")
